<a href="https://colab.research.google.com/github/Arnimaaaa/online-summer-training-on-machine-learning/blob/main/task10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap

##One-Hot encoder
One-hot-encoder returns a vector for each unique value of the categorical column. Each such vector contains only one ‘1’ while all other values in the vector are ‘0’.

Method 1: pd.get_dummies
pd.get_dummies (documentation) returns a new dataframe that contains one-hot-encoded columns.
Method 2: sklearn.preprocessing.OneHotEncoder
 sklearn.preprocessing.OneHotEncoder returns an object of sklearn.preprocessing.OneHotEncoder class.
### Multicollinearity
Multicollinearity occurs when two or more independent variables (a.k.a. features) in the dataset are correlated with each other. 
###Dummy Variable Trap
The dummy variable trap manifests itself directly from one-hot-encoding applied on categorical variables

##What is Nominal and Ordinal Variables ?

Nominal data is a group of non-parametric variables, while Ordinal data is a group of non-parametric ordered variables. Although, they are both non-parametric variables, what differentiates them is the fact that ordinal data is placed into some kind of order by their position.

###Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

In [60]:
import pandas as pd
import numpy as np
df=pd.read_table("https://data.princeton.edu/wws509/datasets/salary.dat", delim_whitespace = True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [17]:
dummy = pd.get_dummies(df[['sx']])
dummy.head()
df = pd.concat([df, dummy], axis = 1)
df.head()

       sx    rk  yr         dg  yd     sl  sx_female  sx_male
0    male  full  25  doctorate  35  36350          0        1
1    male  full  13  doctorate  22  35350          0        1
2    male  full  10  doctorate  23  28200          0        1
3  female  full   7  doctorate  27  26775          1        0
4    male  full  19    masters  30  33696          0        1

In [18]:
df = df.merge(dummy, left_index=True, right_index=True)
df.head()

       sx    rk  yr         dg  ...  sx_female_x  sx_male_x  sx_female_y  sx_male_y
0    male  full  25  doctorate  ...            0          1            0          1
1    male  full  13  doctorate  ...            0          1            0          1
2    male  full  10  doctorate  ...            0          1            0          1
3  female  full   7  doctorate  ...            1          0            1          0
4    male  full  19    masters  ...            0          1            0          1

[5 rows x 10 columns]

In [20]:
cat = df.select_dtypes(include='O').keys()
# display variabels
cat

Index(['sx', 'rk', 'dg'], dtype='object')

In [21]:
new_df=pd.read_table("https://data.princeton.edu/wws509/datasets/salary.dat", delim_whitespace = True)
new_df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [22]:
# unique values in each columns
for x in new_df.columns:
    #prinfting unique values
    print(x ,':', len(new_df[x].unique()))

sx : 2
rk : 3
yr : 18
dg : 2
yd : 29
sl : 51

In [26]:
# finding the top 20 categories
new_df.sx.value_counts().sort_values(ascending=False).head(20)

male      38
female    14
Name: sx, dtype: int64

In [35]:
# make list with top 10 variables
top_10 = [x for x in new_df.sx.value_counts().sort_values(ascending=False).head(10).index]
top_10

['male', 'female']

In [75]:
# for all categorical variables we selected
def top_x(df2,variable,top_x_labels):
  for label in top_x_labels:
   df2[variable+'_'+label] = np.where(data[variable]==label,1,0)
# read the data again
data = pd.read_table("https://data.princeton.edu/wws509/datasets/salary.dat", delim_whitespace = True)
#encode Nighborhood into the 10 most frequent categories
top_x(data,'sx',top_10)
# display data
data.head()

       sx    rk  yr         dg  yd     sl  sx_male  sx_female
0    male  full  25  doctorate  35  36350        1          0
1    male  full  13  doctorate  22  35350        1          0
2    male  full  10  doctorate  23  28200        1          0
3  female  full   7  doctorate  27  26775        0          1
4    male  full  19    masters  30  33696        1          0